# Pandas
---

Pandas is a data analysis tool, built on top of numpy.

In [1]:
import pandas as pd

In [2]:
names = ["Nepal", "India", "Bhutan"]
codes = [977, 81, 123]

In [3]:
list(zip(names, codes))

[('Nepal', 977), ('India', 81), ('Bhutan', 123)]

**zip: ** *zip creates collection of tuples out of each elements of given lists*

In [4]:
zip([1, 2, 3], [11, 12, 13], [21, 22, 23])

In [5]:
list(zip([1, 2, 3], [11, 12, 13], [21, 22, 23]))

[(1, 11, 21), (2, 12, 22), (3, 13, 23)]

*We create a dataset with names and codes*

In [6]:
dataset = list(zip(names, codes))

In [7]:
dataset

[('Nepal', 977), ('India', 81), ('Bhutan', 123)]

**Now we create a dataframe**

Dataframe is generally a tabular data with rows and columns ( similar to that of excel ).

In [8]:
df = pd.DataFrame(data=dataset, columns=["Name", "Code"])

In [9]:
df

     Name  Code
0   Nepal   977
1   India    81
2  Bhutan   123

*Here, each row defines a unique set of observation or condition, while each column defines parameters for observations*

*In above dataframe, Name and Code are parameters we are using to define a country and each row i.e Nepal and 977 collectively gives us unique set*

*__0__, __1__ .. are called index in pandas, they are generated while creating a dataframe*

*Let's create a large dataset*

In [10]:
import numpy as np

In [11]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']

In [12]:
np.random.randint(low=0, high=len(names))

3

In [13]:
random_names = [names[np.random.randint(low=0, high=len(names))] 
                for i in range(1000)]

In [14]:
random_names[:10]

['Jessica',
 'John',
 'Jessica',
 'John',
 'Mary',
 'Bob',
 'John',
 'Bob',
 'Bob',
 'Mel']

In [15]:
ages = [np.random.randint(low=1, high=100) for i in range(1000)]

In [16]:
ages[:10]

[80, 20, 13, 7, 31, 71, 23, 59, 43, 82]

In [17]:
df = pd.DataFrame(list(zip(random_names, ages)), 
                  columns=["Name", "Age"])

In [18]:
df

        Name  Age
0    Jessica   80
1       John   20
2    Jessica   13
3       John    7
4       Mary   31
5        Bob   71
6       John   23
7        Bob   59
8        Bob   43
9        Mel   82
10      Mary   63
11       Bob   15
12      John    5
13   Jessica   56
14       Bob   64
15   Jessica   75
16   Jessica    5
17       Bob   80
18      Mary   95
19      Mary   41
20       Bob   34
21       Mel   14
22       Bob   26
23      Mary   26
24   Jessica   89
25      Mary   78
26   Jessica   21
27      Mary   19
28      Mary    5
29      John   76
..       ...  ...
970      Mel   92
971      Bob   72
972     John   67
973     John   24
974     Mary   22
975     John   46
976      Bob    6
977     Mary   73
978      Bob   58
979     John   99
980      Mel    6
981     Mary   12
982      Bob   83
983     Mary   62
984      Mel   18
985      Bob   90
986     Mary   14
987     John   29
988  Jessica   32
989      Bob   91
990     Mary   85
991     John   81
992     John   97
993     Mary   73
994      Bob   52
995  Jessica   67
996      Bob   71
997     Mary   16
998     John   40
999     Mary   32

[1000 rows x 2 columns]

**Overview of data**

*show first 5 rows*

In [19]:
df.head()

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31

*or 10*

In [20]:
df.head(10)

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31
5      Bob   71
6     John   23
7      Bob   59
8      Bob   43
9      Mel   82

*show last 5 rows*

In [21]:
df.tail()

        Name  Age
995  Jessica   67
996      Bob   71
997     Mary   16
998     John   40
999     Mary   32

*or 10*

In [22]:
df.tail(10)

        Name  Age
990     Mary   85
991     John   81
992     John   97
993     Mary   73
994      Bob   52
995  Jessica   67
996      Bob   71
997     Mary   16
998     John   40
999     Mary   32

### Selecting rows and columns

**select single column from dataframe**

In [23]:
df["Name"]

0      Jessica
1         John
2      Jessica
3         John
4         Mary
5          Bob
6         John
7          Bob
8          Bob
9          Mel
10        Mary
11         Bob
12        John
13     Jessica
14         Bob
15     Jessica
16     Jessica
17         Bob
18        Mary
19        Mary
20         Bob
21         Mel
22         Bob
23        Mary
24     Jessica
25        Mary
26     Jessica
27        Mary
28        Mary
29        John
        ...
970        Mel
971        Bob
972       John
973       John
974       Mary
975       John
976        Bob
977       Mary
978        Bob
979       John
980        Mel
981       Mary
982        Bob
983       Mary
984        Mel
985        Bob
986       Mary
987       John
988    Jessica
989        Bob
990       Mary
991       John
992       John
993       Mary
994        Bob
995    Jessica
996        Bob
997       Mary
998       John
999       Mary
Name: Name, Length: 1000, dtype: object

*Note: such selection which gave us rows of a single column, are called Series in pandas*

**Select multiple columns from dataframe**

In [24]:
df[["Name", "Age"]].head()

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31

*we are selecting multiple columns with list of columns ["Name", "Age"]*

**Select row from dataframe**

*Select from index*

In [26]:
# donot use this: deprecated
df.ix[0]

Name    Jessica
Age          80
Name: 0, dtype: object

> index can be either integers as above or any string, depends on dataframe

*Select from location*

In [27]:
df.iloc[0]

Name    Jessica
Age          80
Name: 0, dtype: object

> it is integer based location

*Select from labelled location*

In [28]:
df.loc[0]

Name    Jessica
Age          80
Name: 0, dtype: object

*Slicing based selection*

In [29]:
df.loc[0:6]

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31
5      Bob   71
6     John   23

In [30]:
df.iloc[0:6]

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31
5      Bob   71

**Behavior of loc and iloc**

In [31]:
# let's create a new dataframe with selected rows
ndf = df.loc[10:20]

In [32]:
ndf

       Name  Age
10     Mary   63
11      Bob   15
12     John    5
13  Jessica   56
14      Bob   64
15  Jessica   75
16  Jessica    5
17      Bob   80
18     Mary   95
19     Mary   41
20      Bob   34

In [33]:
ndf.loc[0]

KeyError: 'the label [0] is not in the [index]'

In [34]:
ndf.iloc[0]

Name    Mary
Age       63
Name: 10, dtype: object

In [35]:
ndf.loc[10]

Name    Mary
Age       63
Name: 10, dtype: object

In [36]:
mdf = pd.DataFrame([('Apple', 42, 56), ('Orange', 42, 56), 
                    ('Pineapple', 42, 56), ('Lime', 42, 56)], 
                   columns=["Name", "Price", "Qty"])

In [37]:
mdf = mdf.set_index(["Name"])

In [38]:
mdf

           Price  Qty
Name
Apple         42   56
Orange        42   56
Pineapple     42   56
Lime          42   56

In [39]:
mdf.iloc[0]

Price    42
Qty      56
Name: Apple, dtype: int64

In [40]:
mdf.loc[0]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [41]:
mdf.loc["Apple"]

Price    42
Qty      56
Name: Apple, dtype: int64

In [42]:
mdf.iloc["Apple"]

TypeError: cannot do positional indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [Apple] of <class 'str'>

*In above 3 cells, __loc__ is trying to access by index __0__, which is not present in our new dataframe while __iloc__ fetched 1st row or 0th data from our new dataframe*

**Silicing by rows and columns**

In [43]:
# get all data from 0 to 6 row and column "Age"
df.loc[0:6, "Age"]

0    80
1    20
2    13
3     7
4    31
5    71
6    23
Name: Age, dtype: int64

In [44]:
# get all data from 0 to 6 and column "Name" to "Age"
df.loc[0:6, "Name": "Age"]

      Name  Age
0  Jessica   80
1     John   20
2  Jessica   13
3     John    7
4     Mary   31
5      Bob   71
6     John   23

In [45]:
# column slicing should be in sequential order to that 
# of columns of dataframe
df.loc[0:6, "Age": "Name"]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

**Changing columns of dataframe**

In [46]:
df.columns = ["Name of people", "Age of people"]

In [47]:
df.head()

  Name of people  Age of people
0        Jessica             80
1           John             20
2        Jessica             13
3           John              7
4           Mary             31

**Filtering basics**

In [48]:
# get all people whose age is less than 10
df[df["Age of people"] < 10]

    Name of people  Age of people
3             John              7
12            John              5
16         Jessica              5
28            Mary              5
61             Mel              2
73         Jessica              7
91            Mary              8
104        Jessica              2
106           John              7
109            Bob              9
112            Bob              6
130            Mel              7
136        Jessica              1
140            Bob              3
142        Jessica              3
145            Bob              2
147        Jessica              3
154            Mel              4
159        Jessica              1
161        Jessica              1
187           Mary              4
209            Bob              4
221           Mary              2
225        Jessica              5
230           Mary              2
245           Mary              9
249           Mary              8
258           John              8
261            Mel              6
270            Bob              3
..             ...            ...
640            Mel              3
646            Mel              7
651           John              5
660            Mel              1
671            Bob              3
687            Mel              7
696            Bob              7
715        Jessica              3
723            Mel              7
728            Bob              9
731           Mary              8
734            Bob              3
769            Bob              3
771            Bob              1
786            Bob              9
787            Mel              8
801           Mary              1
807            Mel              1
827            Mel              2
829            Bob              1
846           Mary              4
851        Jessica              9
859           John              4
889            Bob              6
891            Mel              3
917            Mel              8
923            Bob              2
941           Mary              3
976            Bob              6
980            Mel              6

[94 rows x 2 columns]

In [49]:
# get all people whose age is less than 10 or age is greater than 90
df[(df["Age of people"] < 10) | (df["Age of people"] > 90)]

    Name of people  Age of people
3             John              7
12            John              5
16         Jessica              5
18            Mary             95
28            Mary              5
42            John             98
61             Mel              2
73         Jessica              7
91            Mary              8
103            Bob             96
104        Jessica              2
106           John              7
109            Bob              9
112            Bob              6
118        Jessica             94
130            Mel              7
136        Jessica              1
140            Bob              3
142        Jessica              3
145            Bob              2
147        Jessica              3
150           John             95
154            Mel              4
156           Mary             95
159        Jessica              1
161        Jessica              1
187           Mary              4
193           John             98
194           Mary             92
199            Bob             97
..             ...            ...
821           John             95
827            Mel              2
829            Bob              1
831            Bob             99
837           Mary             94
846           Mary              4
851        Jessica              9
852           Mary             92
854            Mel             93
859           John              4
872           Mary             97
880           John             95
881           John             94
889            Bob              6
890            Mel             96
891            Mel              3
904           Mary             96
917            Mel              8
922            Bob             98
923            Bob              2
937           Mary             99
941           Mary              3
948        Jessica             97
965            Mel             93
970            Mel             92
976            Bob              6
979           John             99
980            Mel              6
989            Bob             91
992           John             97

[177 rows x 2 columns]

In [50]:
# get mean
df.mean()

Age of people    49.009
dtype: float64

In [51]:
# get max
df.max()

Name of people    Mel
Age of people      99
dtype: object

In [52]:
# get min
df.min()

Name of people    Bob
Age of people       1
dtype: object

In [53]:
# get median
df.median()

Age of people    48.0
dtype: float64

In [54]:
# get standard deviation
df.std()

Age of people    28.37178
dtype: float64

In [55]:
df.head()

  Name of people  Age of people
0        Jessica             80
1           John             20
2        Jessica             13
3           John              7
4           Mary             31

In [56]:
df.groupby("Name of people").mean()

                Age of people
Name of people
Bob                 44.323529
Jessica             51.481481
John                53.302439
Mary                49.321951
Mel                 46.695431